---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorNumber
source: html/75e2d74e-a5df-548e-86a9-5497796d71ff.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorNumber Property

"Mark"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorNumber { get; }
```